---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.WireDiameter
source: html/0a4a49d3-d226-efb1-9eaf-1998f78b34c6.htm
---
# Autodesk.Revit.DB.SpecTypeId.WireDiameter Property

Wire Diameter, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId WireDiameter { get; }
```